Revit 2024 API
BuiltInFailures.ImportFailures.IFCGenericRevitImportWarning Property
 Revit had the following problems importing the IFC file: [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId IFCGenericRevitImportWarning { get; }
Visual Basic
Public Shared ReadOnly Property IFCGenericRevitImportWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ IFCGenericRevitImportWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ImportFailures Class
Autodesk.Revit.DB Namespace